{
    "welcome_title": "Welcome to Amethyst Player",
    "welcome_content": "Amethyst Player is an very easy to use app that lets you play lightshow projects on your compatible grid controllers. This tutorial will guide you through the main features.",
    "load_project_title": "Load Your First Project",
    "load_project_content": "Click 'Load Project' in the sidebar to open a project file. Amethyst supports Unipack and other project formats.",
    "load_project_content_mobile": "Tap 'Load Project' in the sidebar to open a project file. Amethyst supports Unipack and other project formats.",
    "project_info_title": "Project Information",
    "project_info_content": "Once a project is loaded, you'll see the project details here including the author name and project title. You can also load a new project anytime.",
    "demo_controls_title": "Demo Play Controls",
    "demo_controls_content": "Use these controls to automatically play through your project. The timeline shows your progress, and you can play, pause, or navigate through the sequence.",
    "demo_settings_title": "Demo Play Settings Menu",
    "demo_settings_content": "Click the gear icon next to 'Project Demoplay' to access additional demo play settings and options.",
    "demo_settings_content_mobile": "Tap the gear icon next to 'Project Demoplay' to access additional demo play settings and options.",
    "toggle_sidebar_title": "Toggle Sidebar",
    "toggle_sidebar_content": "Use the menu icon at the top to show or hide the sidebar. This gives you more space for the virtual device display. Let's try it now!",
    "virtual_device_title": "Virtual Device Display",
    "virtual_device_content": "This is your virtual device. You can click pads to trigger sounds and see lighting effects. Click in empty space around the device to toggle fullscreen mode. Scale and device type can be changed in settings.",
    "virtual_device_content_mobile": "This is your virtual device in full view! You can tap pads to trigger sounds and see lighting effects. Scale and device type can be changed in settings. ",
    "layer_navigation_title": "Layer Navigation",
    "layer_navigation_content": "Projects are organized into layers. Use the layer selector at the bottom to switch between different layers. Click on layer numbers, use the arrow buttons, or press number keys on keyboard to navigate. Each layer can have different lighting patterns and sounds.",
    "layer_navigation_content_mobile": "Projects are organized into layers. Use the layer selector at the bottom to switch between different layers. Tap on layer numbers or use the arrow buttons to navigate. Each layer can have different lighting patterns and sounds.",
    "return_sidebar_title": "Return to Sidebar",
    "return_sidebar_content": "Now let's return to sidebar view. Tap the hamburger menu icon again to bring back the sidebar with all your controls.",
    "settings_title": "Settings & Configuration",
    "settings_content": "Access settings to customize your virtual device, project engine, and display preferences. You can also change the language here.",
    "devices_title": "MIDI Device Connection",
    "devices_content": "Connect your physical MIDI devices here. Amethyst will automatically detect compatible controllers.",
    "keyboard_shortcuts_title": "Keyboard Shortcuts",
    "keyboard_shortcuts_content": "Master these shortcuts:\n• Space/P: Play/Pause\n• Left/A: Demo play move backward\n• Right/D: Demo play move forward\n• Up/W/E: Next layer\n• Down/S/Q: Previous layer\n• 0-9: Switch to specific layer\n• F/Enter/Esc: Toggle sidebar\n• H: Show this tutorial\n• Z: Settings Menu\n• X: Device Menu",
    "ready_title": "You're Ready!",
    "ready_content": "That's it! You're now ready to use Amethyst Player. Load a project and start playing!.",
    "skip_tutorial": "Skip Tutorial",
    "back": "Back",
    "next": "Next",
    "finish": "Finish",
    "show_tutorial": "Show Tutorial",
    "help_and_tutorial": "Help & Tutorial:"
}